[
  {
    "date": "06/11/2021",
    "title": "Mongo DB subdocuments and associations",
    "description": "Added subdocument PostSchema to the User Model.  Tested adding and removing subdocuments to and fron existing records.  Added a virtual type to take the place of the incrementally defined postCount. Created associations using Refs.",
    "tools": "mongodb, mongoose, mocha, javascript, node, subdocument, virtual type associations"
  },
  {
    "date": "06/11/2021",
    "title": "Mongo DB subdocuments and associations",
    "description": "Added subdocument PostSchema to the User Model.  Tested adding and removing subdocuments to and fron existing records.  Added a virtual type to take the place of the incrementally defined postCount. Created associations using Refs.",
    "tools": "mongodb, mongoose, mocha, javascript, node, subdocument, virtual type associations"
  },
  {
    "date": "06/10/2021",
    "title": "Mongo DB queries and operators",
    "description": "Went through the many different queries you can use to achieve full CRUD in MongoDB and Mongoose. Used the increment update operator.  Also inplemented basic validation requiring a name and the name length to be more than 2 characters.",
    "tools": "mongodb, mongoose, mocha, javascript, node, validation, operators, queries"
  },
  {
    "date": "06/09/2021",
    "title": "Slowly moving through Mongo DB",
    "description": "Built a lot of mocha tests today while following the class. Getting back to the basics of MongoDB and Mongoose. Broke out the old Robo3T app, made a Schema, did find and findOne queries.  It's been very good review so far",
    "tools": "mongodb, mongoose, mocha, javascript, node"
  },
  {
    "date": "06/08/2021",
    "title": "The Complete Developers Guide to MongoDB",
    "description": "Started the Stephen Grider 13 hour MongoDB course on Udemy.  I think I could use some polishing on the back end.",
    "tools": "mongodb"
  },

  {
    "date": "06/03/2021",
    "title": "Fixed bigfoot app and put it on portfolio.",
    "description": "The bigfoot app wasn't getting all the information from the bigfoot sightings API so I had to make another get request and then combine the arrays.  It was easier than I thought it would be.  I then added that project to this portfolio page.",
    "tools": "react, api, javascript, mapbox"
  },

  {
    "date": "06/02/2021",
    "title": "Sorta finished the Bigfoot App",
    "description": "I worked on the bigfoot app today and added some ridiculous CSS and soundeffects for my own enjoyment.  It's close to done but I kind of wish i could have gotten the bigfoot pins to only appear on getting the users current position and I'd also like to have a search bar.  The api call isn't getting all the results so I have to figure out how to make subsequent fetches tomorrow. Wasn't as fun as I thought it would be :/",
    "tools": "react, api, css, javascript, animation, transitions, mapbox"
  },
  {
    "date": "06/01/2021",
    "title": "Worked on the Bigfoot App",
    "description": "Worked all day long on the Bigfoot App. It was pretty frusterating because I couldn't get the state to keep up with the rendering from the API call.  I ended up just using a variable which i think is a no no but it sort of worked. Mapbox is pretty cool.  I would like it if bigfoot sighting pins would only load if they are within 10 miles of the user but that seems like a big battle.",
    "tools": "react, state, useEffect, javascript mapbox"
  },
  {
    "date": "05/31/2021",
    "title": "Started working on the Bigfoot App",
    "description": "MEMORIAL DAY - I'm trying to get a users current position on a map that's proving to be more difficult then I thought iT would be because the async nature of getting a location",
    "tools": "react, async, javascript, maps, geolocation"
  },
  {
    "date": "05/30/2021",
    "title": "Added Filter Buttons to Portfolio",
    "description": "I added icon buttons to the top of the page that when clicked will filter the projects out that have that used that tool during developement.",
    "tools": "react, bootstrap"
  },
  {
    "date": "05/29/2021",
    "title": "Built Progress Log",
    "description": "This is my very first entry into the 'Progress Log' and the progress that I'm loggin is the 'Progress Log' itself. I fetched a local JSON with the information on it and looped over it to make this list (only 1 entry right now).  Then made it searchable by Title, Description or Tools. Had to change the function component into a class component which wasn't all that bad. I'll try and log things i've learned, tasks I've accomplished or failed here... Probably should make this log responsive ha ha. 🚀",
    "tools": "react, javascript, json, sticky, css, bootstrap, tables"
  }
]
