[
  {
    "date": "08/10/2021",
    "title": "Continuing JS Algorithm Masterclass",
    "description": "Going over bubble sort and bubble sort optimization.",
    "tools": "bubble sort, optimization, sorting, sort"
  },
  {
    "date": "08/09/2021",
    "title": "Continuing JS Algorithm Masterclass",
    "description": "Went over Linear Search and Binary Search.",
    "tools": "linear search, binary search"
  },
  {
    "date": "07/15/2021",
    "title": "Continuing JS Algorithm Masterclass",
    "description": "Writing recursive functions.",
    "tools": "sliding window, recursion, pure recursion, helper method recursion"
  },
  {
    "date": "07/14/2021",
    "title": "Continuing JS Algorithm Masterclass",
    "description": "Learning the 'sliding window' way of grouping characters in a string. Goin over recursion. Learning the difference between Helper Method Recursion and Pure Recursion. Helper Method Recursion to compile an array.",
    "tools": "sliding window, recursion, pure recursion, helper method recursion"
  },
  {
    "date": "07/09/2021",
    "title": "Continuing JS Algorithm Masterclass",
    "description": "Learning a frequency counter pattern that does not use nested loops to keep it a O(n) instead of O(n^2). Learning about using multiple pointers in loops to compare and sort iterables.",
    "tools": "big o, time complexity, space complexity, algorithms, logarithms"
  },
  {
    "date": "07/08/2021",
    "title": "Beginning: JavaScript and Data Structures Masterclass",
    "description": "Learning about how Big O can help compare algorithms. Learning about counting operations. Learning the difference between O(1), O(n) and O(n^2). Learned hot to simplify big O expressions. Learning the difference between time complexity and space complexity. Insertion, removal, and access of Objects are all O(1).  Searching is O(n).  Array Insertion and Removal is is O(1) if done at the end and O(n) if done at the front. Searching is O(n) and Access is O(1). Very interesting🧐!  Learning steps for a problem solving approach including Understanding the Problem, Exploring Examples, Breaking it Down, Solving and Simplifying, and Refactoring.",
    "tools": "big o, time complexity, space complexity, algorithms, logarithms"
  },
  {
    "date": "07/07/2021",
    "title": "Starting final Typescript/React project",
    "description": "Created a react app. Learning how to use generic Classes with and interface and props. Learned the differences between setting state the simple way and overwriting the typescript definition and using a constructor and having to use the second generic argument for the class component. Learned how to set up a functional component with typescript. FINISHED THE CLASS ! 🏁`",
    "tools": "typescript, react, props, interface, class, component, constructor, enum, function, txs, jsx"
  },
  {
    "date": "07/02/2021",
    "title": "Typescript/Express Project 5 continued",
    "description": "Learning how middleware messes up Typescript when using popular JS frameworks. Added Cookie Sessions.  Set up requireAuth middleware. Refactoring the App to get the benefits of Typescript such as type safety and enhancing the developer experience. Learning about decorators. Reviewing prototypes.",
    "tools": "typscript, middleware, express, decorators, prototypes"
  },
  {
    "date": "07/01/2021",
    "title": "Typescript Project 4 continued",
    "description": "Finalized the Collection class. Starting the 'view' side of the app. Working on rendering HTML. Rendering user form onto the browser. Added eventing system to view. Added a random age button and method. Making a reusable abstrac class View that renders HTML. Added a user save button. Finished the 4th project.  It was very long and was 6 hours of video. On to Express and Typescript Integration. Built out a very simple server, learning why Express (and body-parser) is hard to use with Typescript.",
    "tools": "typscript, views, classes, class, template element, render, html, abstract, , express, body-parser"
  },
  {
    "date": "06/30/2021",
    "title": "Typescript Project 4 continued",
    "description": "Added the fetch and save methods.  Attempting to make the User class more reusable. More learning about Inheritance vs Composition.",
    "tools": "typscript"
  },
  {
    "date": "06/29/2021",
    "title": "Typescript Project 4 continued",
    "description": "Building a JSON server. Saving users to the JSON server. Added fetch functionality.  Added post and put functionality. Beginning Composition refactor of User 'megaclass'. Refactored and added eventing class. Extracted 3 classes from User.ts. Learned that in Typescript a string can by a type.",
    "tools": "typescript, generics, type inference, eventer, eventing, crud, axios"
  },
  {
    "date": "06/28/2021",
    "title": "Typescript Project 3 continued",
    "description": "Finsished project 3, now going more in depth learning bout Generics. Condensing simmilar classed into one using Generics. Learning about type inference. Started project 4: 'Let's Build a Framework'.  Working on the User 'MegaClass'. Making an eventing style setup.",
    "tools": "typescript, generics, type inference, eventer, eventing"
  },
  {
    "date": "06/27/2021",
    "title": "Typescript Project 3 continued",
    "description": "Learning about and implementing Generics. Refactored the CsvFilerReader to be more reusable. Learning about Inheritance vs Composition.",
    "tools": "typescript, generic, inheritance, composition"
  },
  {
    "date": "06/25/2021",
    "title": "Typescript Project 2 continued (it's my birthday!🎈)",
    "description": "Learning about and implementing Abstract Classes. Refactored other Classes to extend the abstract class of Sorter.  Learning when and why to use Interfaces vs. Inheritance/Abstract Classes.  Started new Typescript project called Stats.  Added a csv file which we parsed and ran one simple analysis. Now I am being introduced to Enums. Used a Type Assertion.  Added a Tuple and am getting ready to refactor the CsvFileReader class.",
    "tools": "typescript, sorting, sort, algorithms, abstract classes, enum"
  },
  {
    "date": "06/24/2021",
    "title": "Typescript Project 2 continued",
    "description": "Learning why Type Guards might not always be the best thing to use. Added more classes to make the app more reusable. Added an algorithm to sort a linked list which was pretty confusing.",
    "tools": "typscript, sorting, sort, algorithms, bubble sort, type guards,"
  },
  {
    "date": "06/23/2021",
    "title": "Typescript Project 2",
    "description": "Started a Typescript sorting project. Configuired the Typescript compiler.  Wrote up a bubble sort now working on a Type Guard.",
    "tools": "typscript, sorting, sort, algorithms, bubble sort"
  },
  {
    "date": "06/22/2021",
    "title": "Continuing the Typescript Class",
    "description": "Learning about Interfaces and Interface reusability. Learning the difference between public, private and protected Class methods.Began first application dealing with typescript design patterns. Learned about type definition files and how to read them instead of the docs. Attempting to write more reusable typescript. Used an Interface for reusability. Added the implment clause to help typescript show us the errors. Finished the first simple Typescript app.",
    "tools": "typscript, interface, design patterns, type definition files, implement clause"
  },
  {
    "date": "06/21/2021",
    "title": "Began Typescript class just to shake things up",
    "description": "Made first tiny Typescript app. Learning about type annotations vs type inference.  Learned about annotating different values from primitives to objects,classes,arrays and functions. Learned about typed arrays and having multiple values. Learned about annotating tuples and how we'll probably never use them ha ha.",
    "tools": "typescript, tuples, interfaces, annotations, inference"
  },
  {
    "date": "06/20/2021",
    "title": "Made it to client side on the Grider project",
    "description": "Finally made it to the client side and added the React server. Added the concurrently module for simultaneous server starting. Refactored the then() promises to async and await.",
    "tools": "express, heroku, oauth, passportjs, cookies, mongoose, google"
  },

  {
    "date": "06/19/2021",
    "title": "MERN project and started doing Exercism problems",
    "description": "I started doing the Javascript track at on exercism.io.  I always sort of enjoy doing algorithm practice until i don't... ha ha. Working on the Node with React class finally made it so the user can logout. I think authenication is finally over. Made a production setup and a dev set up.",
    "tools": "express, heroku, oauth, passportjs, cookies, mongoose, google"
  },
  {
    "date": "06/17/2021",
    "title": "Still Working Through Authentication",
    "description": "Added Oauth and cookies to authorize the User. Wrote a route to test the entire Oauth flow.",
    "tools": "express, heroku, oauth, passportjs, cookies, mongoose, google"
  },
  {
    "date": "06/16/2021",
    "title": "Began the Node with React: Fullstack Web Development Course",
    "description": "I'm really trying to familiarize myself fully with full-stack web development so I'm taking another Stephen Grider course. I started the express app and deployed to heroku. Spent a great deal of time lecturing about Passport and Oauth eventually finally go the user id (as provided by google) into the database.",
    "tools": "express, heroku, oauth, passportjs, cookies, mongoose, google"
  },

  {
    "date": "06/15/2021",
    "title": "MongoDB new Stephen Grider Project",
    "description": "Added the updateMany query to artists being retired or not retired.  Finished the UpStarMusic project. Finished the project! Started the next and final project of the course.  Making a backend for a Uber rippoff using Express, Mongoose, MongoDB and testing with Mocha and Supertest. Added controllers and routers. Downloaded the Postman App (previously used Insomnia) and checked the PUT request. Added a second database just for testing. Added error handling middleware for the create route. Added update route and tested it.  Added a PointSchema subfdocument for geolocation. Added query for drivers around a certain point geographically.  The final function of the course (geoNear) was deprecated so the final test didn't work... womp womp.  I could figure it out later but  I FINISHED THE COURSE!",
    "tools": "mongodb, mongoose, mocha, javascript, node, sort, crud, limit, skip, geojson, middleware, subdocument, postman"
  },
  {
    "date": "06/14/2021",
    "title": "MongoDB new Stephen Grider Project",
    "description": "Started a new project within the Complete Developers Guide to MongoDB called 'UpStarMusic'.  We started out by making Artist and Album Schemas/models.  Then we moved on to doing the more simple CRUD queries. Added minimum/maximum sort and limit queries for the collection.",
    "tools": "mongodb, mongoose, mocha, javascript, node, sort, crud, limit, skip"
  },
  {
    "date": "06/12/2021",
    "title": "Mongo DB populating",
    "description": "Populated the User blogPosts.  Added middleware and a middleware test to clean up all user blog posts when the user is deleted. Learned about and used Promise.all() which seems pretty handy in my opinion.  We learned about Pagination and implemented sort(), skip(), and limit().  Finished that first project 🏁",
    "tools": "mongodb, mongoose, mocha, javascript, node, subdocument, virtual type associations"
  },
  {
    "date": "06/11/2021",
    "title": "Mongo DB subdocuments and associations",
    "description": "Added subdocument PostSchema to the User Model.  Tested adding and removing subdocuments to and fron existing records.  Added a virtual type to take the place of the incrementally defined postCount. Created associations using Refs.",
    "tools": "mongodb, mongoose, mocha, javascript, node, subdocument, virtual type associations"
  },
  {
    "date": "06/10/2021",
    "title": "Mongo DB queries and operators",
    "description": "Went through the many different queries you can use to achieve full CRUD in MongoDB and Mongoose. Used the increment update operator.  Also inplemented basic validation requiring a name and the name length to be more than 2 characters.",
    "tools": "mongodb, mongoose, mocha, javascript, node, validation, operators, queries"
  },
  {
    "date": "06/09/2021",
    "title": "Slowly moving through Mongo DB",
    "description": "Built a lot of mocha tests today while following the class. Getting back to the basics of MongoDB and Mongoose. Broke out the old Robo3T app, made a Schema, did find and findOne queries.  It's been very good review so far",
    "tools": "mongodb, mongoose, mocha, javascript, node"
  },
  {
    "date": "06/08/2021",
    "title": "The Complete Developers Guide to MongoDB",
    "description": "Started the Stephen Grider 13 hour MongoDB course on Udemy.  I think I could use some polishing on the back end.",
    "tools": "mongodb"
  },

  {
    "date": "06/03/2021",
    "title": "Fixed bigfoot app and put it on portfolio.",
    "description": "The bigfoot app wasn't getting all the information from the bigfoot sightings API so I had to make another get request and then combine the arrays.  It was easier than I thought it would be.  I then added that project to this portfolio page.",
    "tools": "react, api, javascript, mapbox"
  },

  {
    "date": "06/02/2021",
    "title": "Sorta finished the Bigfoot App",
    "description": "I worked on the bigfoot app today and added some ridiculous CSS and soundeffects for my own enjoyment.  It's close to done but I kind of wish i could have gotten the bigfoot pins to only appear on getting the users current position and I'd also like to have a search bar.  The api call isn't getting all the results so I have to figure out how to make subsequent fetches tomorrow. Wasn't as fun as I thought it would be :/",
    "tools": "react, api, css, javascript, animation, transitions, mapbox"
  },
  {
    "date": "06/01/2021",
    "title": "Worked on the Bigfoot App",
    "description": "Worked all day long on the Bigfoot App. It was pretty frusterating because I couldn't get the state to keep up with the rendering from the API call.  I ended up just using a variable which i think is a no no but it sort of worked. Mapbox is pretty cool.  I would like it if bigfoot sighting pins would only load if they are within 10 miles of the user but that seems like a big battle.",
    "tools": "react, state, useEffect, javascript mapbox"
  },
  {
    "date": "05/31/2021",
    "title": "Started working on the Bigfoot App",
    "description": "MEMORIAL DAY - I'm trying to get a users current position on a map that's proving to be more difficult then I thought iT would be because the async nature of getting a location",
    "tools": "react, async, javascript, maps, geolocation"
  },
  {
    "date": "05/30/2021",
    "title": "Added Filter Buttons to Portfolio",
    "description": "I added icon buttons to the top of the page that when clicked will filter the projects out that have that used that tool during developement.",
    "tools": "react, bootstrap"
  },
  {
    "date": "05/29/2021",
    "title": "Built Progress Log",
    "description": "This is my very first entry into the 'Progress Log' and the progress that I'm loggin is the 'Progress Log' itself. I fetched a local JSON with the information on it and looped over it to make this list (only 1 entry right now).  Then made it searchable by Title, Description or Tools. Had to change the function component into a class component which wasn't all that bad. I'll try and log things i've learned, tasks I've accomplished or failed here... Probably should make this log responsive ha ha. 🚀",
    "tools": "react, javascript, json, sticky, css, bootstrap, tables"
  }
]
